app/controllers/user_workouts_controller.rb

    def index
        user_workouts = UserWorkout.all
---
SELECT "user_workouts".* FROM "user_workouts"