app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "res"], ["created_at", "2019-08-20 15:28:42.513004"], ["updated_at", "2019-08-20 15:28:42.513004"]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "cyberRob"], ["LIMIT", 1]]
---
    def login
        user = User.find_or_create_by(username: params[:username])

INSERT INTO "user_workouts" ("user_id", "workout_id", "day_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["workout_id", 11], ["day_id", 5], ["created_at", "2019-08-19 21:39:58.410179"], ["updated_at", "2019-08-19 21:39:58.410179"]]
SELECT "user_workouts".* FROM "user_workouts" WHERE "user_workouts"."user_id" = ?  [["user_id", 3]]
INSERT INTO "workouts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-08-22 00:49:21.425456"], ["updated_at", "2019-08-22 00:49:21.425456"]]
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."name" = ? AND "workouts"."description" = ? AND "workouts"."video_url" = ? AND "workouts"."notes" = ? LIMIT ?  [["name", "new wednesday stuff"], ["description", ""], ["video_url", ""], ["notes", ""], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "user_workouts" ("user_id", "workout_id", "day_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["workout_id", 22], ["day_id", 2], ["created_at", "2019-08-20 12:29:15.918677"], ["updated_at", "2019-08-20 12:29:15.918677"]]
INSERT INTO "workouts" ("name", "description", "video_url", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test sdkf"], ["description", "asfdkh"], ["video_url", ""], ["notes", "afkh"], ["created_at", "2019-08-19 21:39:58.285981"], ["updated_at", "2019-08-19 21:39:58.285981"]]
---
    def addworkouts
        workout = Workout.find_or_create_by(name: params[:name], description: params[:description], video_url: params[:video_url], notes: params[:notes])
        user = User.find(params[:user_id])
        user_workout = UserWorkout.create(user: user, workout: workout, day_id: params[:day_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "user_workouts" WHERE "user_workouts"."id" = ?  [["id", 23]]
SELECT  "user_workouts".* FROM "user_workouts" WHERE "user_workouts"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def delete_workout

        user = User.find(params[:user_id])
        UserWorkout.find(params[:user_workout_id]).destroy