app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts"
---
    def index
        workouts = Workout.all

SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "workouts" SET "video_url" = ?, "notes" = ?, "updated_at" = ? WHERE "workouts"."id" = ?  [["video_url", "https://www.youtube.com/embed/3znzIslrQXg"], ["notes", "https://www.youtube.com/embed/3znzIslrQXg"], ["updated_at", "2019-08-21 12:29:18.856608"], ["id", 9]]
---
    def update
       workout = Workout.find(params[:id])
       workout.update(workout_params)

DELETE FROM "user_workouts" WHERE "user_workouts"."id" = ?  [["id", 19]]
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 5]]
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "user_workouts".* FROM "user_workouts" WHERE "user_workouts"."workout_id" = ?  [["workout_id", 8]]
---
    def destroy
        Workout.find(params[:id]).destroy